#include <stdio.h>
int main()
{
    int a,i;
    while(1)
    {
        scanf("%d", &a);
        if(a==0) break;
        else
        {
            for(i=1; i<a; i++)
                printf("%d ",i);
        }
        printf("%d\n",a);
    }
    return 0;
}
/*আপনার প্রোগ্রামটি অবশ্যই একটি পূর্ণসংখ্যা X অনির্দিষ্ট সময় পড়তে হবে (এক্স শূন্যের সমান হলে প্রোগ্রামটি বন্ধ করতে হবে)। প্রতিটি X-এর জন্য 1 থেকে X পর্যন্ত ক্রমটি মুদ্রণ করুন, এই সংখ্যাগুলির প্রতিটির মধ্যে একটি করে ফাঁকা রাখুন। PS: সাবধানে থাকুন। প্রতিটি লাইনের শেষ সংখ্যার পরে কোনো স্থান ছেড়ে দেবেন না, অন্যথায় আপনি উপস্থাপনা ত্রুটি পাবেন। ইনপুট ইনপুট ফাইলে অনেক পূর্ণসংখ্যা থাকে। শেষটা শূন্য। আউটপুট ইনপুট ফাইলের প্রতিটি সংখ্যা N এর জন্য, একটি আউটপুট লাইন প্রিন্ট করতে হবে, নিম্নলিখিত উদাহরণের মত 1 থেকে N পর্যন্ত। শেষ লাইন নম্বরের পরে ফাঁকা স্থানগুলির বিষয়ে সতর্ক থাকুন।
*/
